RED = "\033[38;2;255;0;0m"
WHITE = "\033[38;2;255;255;255m"
RESET = "\033[0m"

BANNER = f"""{RED}\
      Ю
      ЮЮЮ
      ЮЮЮЮЮ
      ЮЮЮЮЮЮЮ
    ЮЮЮЮЮЮЮЮЮЮЮ         ЮЮЮЮЮЮ  ЮЮЮЮЮЮ  ЮЮЮЮЮЮЮ ЮЮЮЮЮЮЮЮ ЮЮ   ЮЮ
  ЮЮЮЮЮ   ЮЮЮЮЮЮЮ      ЮЮ       ЮЮ   ЮЮ ЮЮ         ЮЮ    ЮЮ   ЮЮ
ЮЮЮЮЮ       ЮЮЮЮЮЮ     ЮЮ   ЮЮЮ ЮЮЮЮЮЮ  ЮЮЮЮЮ      ЮЮ    ЮЮЮЮЮЮЮ
  ЮЮЮЮЮ   ЮЮЮЮЮЮЮ      ЮЮ    ЮЮ ЮЮ   ЮЮ ЮЮ         ЮЮ    ЮЮ   ЮЮ
    ЮЮЮЮЮЮЮЮЮЮЮ         ЮЮЮЮЮЮ  ЮЮ   ЮЮ ЮЮЮЮЮЮЮ    ЮЮ    ЮЮ   ЮЮ
      ЮЮЮЮЮЮЮ                               {WHITE}AI Hacking Adversary{RED}
      ЮЮЮЮЮ
      ЮЮЮ
      Ю
{RESET}"""


def banner():
    print(BANNER)


if __name__ == "__main__":
    banner()
